espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_sig_map.h
#define PARLIO_TX_DATA13_PAD_OUT_IDX                       201
#define PARLIO_RX_DATA14_PAD_IN_IDX                        202
#define PARLIO_TX_DATA14_PAD_OUT_IDX                       202
#define PARLIO_RX_DATA15_PAD_IN_IDX                        203
#define PARLIO_TX_DATA15_PAD_OUT_IDX                       203
#define HP_PROBE_TOP_OUT8_IDX                              204
#define HP_PROBE_TOP_OUT9_IDX                              205
#define HP_PROBE_TOP_OUT10_IDX                             206
#define HP_PROBE_TOP_OUT11_IDX                             207
#define HP_PROBE_TOP_OUT12_IDX                             208
#define HP_PROBE_TOP_OUT13_IDX                             209
#define HP_PROBE_TOP_OUT14_IDX                             210
#define HP_PROBE_TOP_OUT15_IDX                             211
#define CONSTANT0_PAD_OUT_IDX                              212
#define CONSTANT1_PAD_OUT_IDX                              213
#define CORE_GPIO_IN_PAD_IN0_IDX                           214
#define CORE_GPIO_OUT_PAD_OUT0_IDX                         214
#define CORE_GPIO_IN_PAD_IN1_IDX                           215
#define CORE_GPIO_OUT_PAD_OUT1_IDX                         215
#define CORE_GPIO_IN_PAD_IN2_IDX                           216
#define CORE_GPIO_OUT_PAD_OUT2_IDX                         216
#define CORE_GPIO_IN_PAD_IN3_IDX                           217
#define CORE_GPIO_OUT_PAD_OUT3_IDX                         217
#define CORE_GPIO_IN_PAD_IN4_IDX                           218
#define CORE_GPIO_OUT_PAD_OUT4_IDX                         218
#define CORE_GPIO_IN_PAD_IN5_IDX                           219
#define CORE_GPIO_OUT_PAD_OUT5_IDX                         219
#define CORE_GPIO_IN_PAD_IN6_IDX                           220
#define CORE_GPIO_OUT_PAD_OUT6_IDX                         220
#define CORE_GPIO_IN_PAD_IN7_IDX                           221
#define CORE_GPIO_OUT_PAD_OUT7_IDX                         221
#define CORE_GPIO_IN_PAD_IN8_IDX                           222
#define CORE_GPIO_OUT_PAD_OUT8_IDX                         222
#define CORE_GPIO_IN_PAD_IN9_IDX                           223
#define CORE_GPIO_OUT_PAD_OUT9_IDX                         223
#define CORE_GPIO_IN_PAD_IN10_IDX                          224
#define CORE_GPIO_OUT_PAD_OUT10_IDX                        224
#define CORE_GPIO_IN_PAD_IN11_IDX                          225
#define CORE_GPIO_OUT_PAD_OUT11_IDX                        225
#define CORE_GPIO_IN_PAD_IN12_IDX                          226
#define CORE_GPIO_OUT_PAD_OUT12_IDX                        226
#define CORE_GPIO_IN_PAD_IN13_IDX                          227
#define CORE_GPIO_OUT_PAD_OUT13_IDX                        227
#define CORE_GPIO_IN_PAD_IN14_IDX                          228
#define CORE_GPIO_OUT_PAD_OUT14_IDX                        228
#define CORE_GPIO_IN_PAD_IN15_IDX                          229
#define CORE_GPIO_OUT_PAD_OUT15_IDX                        229
#define CORE_GPIO_IN_PAD_IN16_IDX                          230
#define CORE_GPIO_OUT_PAD_OUT16_IDX                        230
#define CORE_GPIO_IN_PAD_IN17_IDX                          231
#define CORE_GPIO_OUT_PAD_OUT17_IDX                        231
#define CORE_GPIO_IN_PAD_IN18_IDX                          232
#define CORE_GPIO_OUT_PAD_OUT18_IDX                        232
#define CORE_GPIO_IN_PAD_IN19_IDX                          233
#define CORE_GPIO_OUT_PAD_OUT19_IDX                        233
#define CORE_GPIO_IN_PAD_IN20_IDX                          234
#define CORE_GPIO_OUT_PAD_OUT20_IDX                        234
#define CORE_GPIO_IN_PAD_IN21_IDX                          235
#define CORE_GPIO_OUT_PAD_OUT21_IDX                        235
#define CORE_GPIO_IN_PAD_IN22_IDX                          236
#define CORE_GPIO_OUT_PAD_OUT22_IDX                        236
#define CORE_GPIO_IN_PAD_IN23_IDX                          237
#define CORE_GPIO_OUT_PAD_OUT23_IDX                        237
#define CORE_GPIO_IN_PAD_IN24_IDX                          238
#define CORE_GPIO_OUT_PAD_OUT24_IDX                        238
#define CORE_GPIO_IN_PAD_IN25_IDX                          239
#define CORE_GPIO_OUT_PAD_OUT25_IDX                        239
#define CORE_GPIO_IN_PAD_IN26_IDX                          240
#define CORE_GPIO_OUT_PAD_OUT26_IDX                        240
#define CORE_GPIO_IN_PAD_IN27_IDX                          241
#define CORE_GPIO_OUT_PAD_OUT27_IDX                        241
#define CORE_GPIO_IN_PAD_IN28_IDX                          242
#define PARLIO_TX_CS_PAD_OUT_IDX                           242    // only exists on ESP32P4 Rev. 3.0 and later
#define CORE_GPIO_IN_PAD_IN29_IDX                          243
#define CORE_GPIO_OUT_PAD_OUT29_IDX                        243
#define CORE_GPIO_IN_PAD_IN30_IDX                          244
#define CORE_GPIO_OUT_PAD_OUT30_IDX                        244
#define CORE_GPIO_IN_PAD_IN31_IDX                          245
#define CORE_GPIO_OUT_PAD_OUT31_IDX                        245
#define RMT_SIG_PAD_IN0_IDX                                246
#define RMT_SIG_PAD_OUT0_IDX                               246
#define RMT_SIG_PAD_IN1_IDX                                247
#define RMT_SIG_PAD_OUT1_IDX                               247
#define RMT_SIG_PAD_IN2_IDX                                248
#define RMT_SIG_PAD_OUT2_IDX                               248
#define RMT_SIG_PAD_IN3_IDX                                249
#define RMT_SIG_PAD_OUT3_IDX                               249
#define SIG_IN_FUNC250_IDX                                 250
#define SIG_IN_FUNC250_IDX                                 250
#define SIG_IN_FUNC251_IDX                                 251
#define SIG_IN_FUNC251_IDX                                 251
#define SIG_IN_FUNC252_IDX                                 252
#define SIG_IN_FUNC252_IDX                                 252
#define SIG_IN_FUNC253_IDX                                 253
#define SIG_IN_FUNC253_IDX                                 253
#define SIG_IN_FUNC254_IDX                                 254
#define SIG_IN_FUNC254_IDX                                 254
#define SIG_IN_FUNC255_IDX                                 255
#define SIG_IN_FUNC255_IDX                                 255
#define SIG_GPIO_OUT_IDX                                   256
